#!/usr/local/env python3
CityList = {"华北地区": {
    "北京市":
        ['东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区','密云县','延庆县'],
    "天津市":
        ['和平区', '河东区', '河西区', '南开区', '河北区', '红桥区', '塘沽区', '汉沽区', '大港区', '东丽区', '西青区', '津南区','北辰区', '武清区', '宝坻区', '宁河县', '静海县', '蓟县'],
    "河北省":
        ['石家庄市','秦皇岛市'],
    "山西省":
        ['太原市','大同市'],
    "内蒙古自治区":
        ['呼和浩特市','包头市']
    },
    "东北地区": {
    "辽宁省": ["铁岭市","阜新市","朝阳市","沈阳市"],
    "吉林省": ['长春市','吉林市','辽源市'],
    "黑龙江省": ['哈尔滨市','齐齐哈尔市']
    },
    "华东地区": {
    "上海市": ["浦东新区","长宁区","宝山区","青浦区"],
    "江苏省": ['南京市','徐州市'],
    "浙江省": ['杭州市','宁波市'],
    "安徽省": ['合肥市','淮南市'],
    "福建省": ['福州市','厦门市'],
    "江西省": ['南昌市','景德镇市'],
    "山东省": ["济南市","青岛市","潍坊市","德州市"]
    },
    "华中地区": {
    "河南省": ['郑州市','洛阳市'],
    "湖北省": ['武汉市','荆门市'],
    "湖南省": ['长沙市','株洲市']
    },
    "华南地区": {
    "广东省": ['广州市','深圳市'],
    "海南省": ['海口市','三亚市','五指山市', '琼海市', '儋州市', '文昌市', '万宁市', '东方市'],
    "广西壮族自治区": ['南宁市','桂林市']
    },
    "西南地区": {
    "重庆市": ['渝中区', '大渡口区', '江北区', '沙坪坝区', '九龙坡区', '南岸区', '北碚区', '万盛区', '双桥区', '渝北区'],
    "四川省": ['成都市','自贡市'],
    "贵州省": ['贵阳市','遵义市'],
    "云南省": ['昆明市','保山市'],
    "西藏自治区": ['拉萨市','昌都地区']
    },
    "西北地区": {
    "陕西省": ['西安市','宝鸡市'],
    "甘肃省": ['兰州市','天水市'],
    "青海省": ['西宁市','玉树州'],
    "宁夏回族自治区": ['银川市','石嘴山市'],
    "新疆维吾尔族自治区": ['乌鲁木齐市','克拉玛依市']
    },
    "特别行政区": {
    "香港特别行政区": ['中西区', '东区', '九龙城区', '观塘区', '南区', '深水埗区', '黄大仙区', '湾仔区', '油尖旺区', '离岛区', '葵青区', '北区', '西贡区', '沙田区', '屯门区', '大埔区', '荃湾区', '元朗区'],
    "澳门特别行政区": [],
    "台湾省": ['台北市', '高雄市', '基隆市', '台中市', '台南市', '新竹市', '嘉义市']
    }
}
